OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1619.h
extern __at(0x060F) __sfr PID1ACCLL;

typedef union
  {
  struct
    {
    unsigned PID1ACC0           : 1;
    unsigned PID1ACC1           : 1;
    unsigned PID1ACC2           : 1;
    unsigned PID1ACC3           : 1;
    unsigned PID1ACC4           : 1;
    unsigned PID1ACC5           : 1;
    unsigned PID1ACC6           : 1;
    unsigned PID1ACC7           : 1;
    };

  struct
    {
    unsigned ACC0               : 1;
    unsigned ACC1               : 1;
    unsigned ACC2               : 1;
    unsigned ACC3               : 1;
    unsigned ACC4               : 1;
    unsigned ACC5               : 1;
    unsigned ACC6               : 1;
    unsigned ACC7               : 1;
    };
  } __PID1ACCLLbits_t;

extern __at(0x060F) volatile __PID1ACCLLbits_t PID1ACCLLbits;

#define _PID1ACCLL_PID1ACC0     0x01
#define _PID1ACCLL_ACC0         0x01
#define _PID1ACCLL_PID1ACC1     0x02
#define _PID1ACCLL_ACC1         0x02
#define _PID1ACCLL_PID1ACC2     0x04
#define _PID1ACCLL_ACC2         0x04
#define _PID1ACCLL_PID1ACC3     0x08
#define _PID1ACCLL_ACC3         0x08
#define _PID1ACCLL_PID1ACC4     0x10
#define _PID1ACCLL_ACC4         0x10
#define _PID1ACCLL_PID1ACC5     0x20
#define _PID1ACCLL_ACC5         0x20
#define _PID1ACCLL_PID1ACC6     0x40
#define _PID1ACCLL_ACC6         0x40
#define _PID1ACCLL_PID1ACC7     0x80
#define _PID1ACCLL_ACC7         0x80

//==============================================================================


//==============================================================================
//        PID1ACCLH Bits

extern __at(0x0610) __sfr PID1ACCLH;

typedef union
  {
  struct
    {
    unsigned PID1ACC8           : 1;
    unsigned PID1ACC9           : 1;
    unsigned PID1ACC10          : 1;
    unsigned PID1ACC11          : 1;
    unsigned PID1ACC12          : 1;
    unsigned PID1ACC13          : 1;
    unsigned PID1ACC14          : 1;
    unsigned PID1ACC15          : 1;
    };

  struct
    {
    unsigned ACC8               : 1;
    unsigned ACC9               : 1;
    unsigned ACC10              : 1;
    unsigned ACC11              : 1;
    unsigned ACC12              : 1;
    unsigned ACC13              : 1;
    unsigned ACC14              : 1;
    unsigned ACC15              : 1;
    };
  } __PID1ACCLHbits_t;

extern __at(0x0610) volatile __PID1ACCLHbits_t PID1ACCLHbits;

#define _PID1ACCLH_PID1ACC8     0x01
#define _PID1ACCLH_ACC8         0x01
#define _PID1ACCLH_PID1ACC9     0x02
#define _PID1ACCLH_ACC9         0x02
#define _PID1ACCLH_PID1ACC10    0x04
#define _PID1ACCLH_ACC10        0x04
#define _PID1ACCLH_PID1ACC11    0x08
#define _PID1ACCLH_ACC11        0x08
#define _PID1ACCLH_PID1ACC12    0x10
#define _PID1ACCLH_ACC12        0x10
#define _PID1ACCLH_PID1ACC13    0x20
#define _PID1ACCLH_ACC13        0x20
#define _PID1ACCLH_PID1ACC14    0x40
#define _PID1ACCLH_ACC14        0x40
#define _PID1ACCLH_PID1ACC15    0x80
#define _PID1ACCLH_ACC15        0x80

//==============================================================================


//==============================================================================
//        PID1ACCHL Bits

extern __at(0x0611) __sfr PID1ACCHL;

typedef union
  {
  struct
    {
    unsigned PID1ACC16          : 1;
    unsigned PID1ACC17          : 1;
    unsigned PID1ACC18          : 1;
    unsigned PID1ACC19          : 1;
    unsigned PID1ACC20          : 1;
    unsigned PID1ACC21          : 1;
    unsigned PID1ACC22          : 1;
    unsigned PID1ACC23          : 1;
    };

  struct
    {
    unsigned ACC16              : 1;
    unsigned ACC17              : 1;
    unsigned ACC18              : 1;
    unsigned ACC19              : 1;
    unsigned ACC20              : 1;
    unsigned ACC21              : 1;
    unsigned ACC22              : 1;
    unsigned ACC23              : 1;
    };
  } __PID1ACCHLbits_t;

extern __at(0x0611) volatile __PID1ACCHLbits_t PID1ACCHLbits;

#define _PID1ACC16              0x01
#define _ACC16                  0x01
#define _PID1ACC17              0x02
#define _ACC17                  0x02
#define _PID1ACC18              0x04
#define _ACC18                  0x04
#define _PID1ACC19              0x08
#define _ACC19                  0x08
#define _PID1ACC20              0x10
#define _ACC20                  0x10
#define _PID1ACC21              0x20
#define _ACC21                  0x20
#define _PID1ACC22              0x40
#define _ACC22                  0x40
#define _PID1ACC23              0x80
#define _ACC23                  0x80

//==============================================================================


//==============================================================================
//        PID1ACCHH Bits

extern __at(0x0612) __sfr PID1ACCHH;

typedef union
  {
  struct
    {
    unsigned PID1ACC24          : 1;
    unsigned PID1ACC25          : 1;
    unsigned PID1ACC26          : 1;
    unsigned PID1ACC27          : 1;
    unsigned PID1ACC28          : 1;
    unsigned PID1ACC29          : 1;
    unsigned PID1ACC30          : 1;
    unsigned PID1ACC31          : 1;
    };

  struct
    {
    unsigned ACC24              : 1;
    unsigned ACC25              : 1;
    unsigned ACC26              : 1;
    unsigned ACC27              : 1;
    unsigned ACC28              : 1;
    unsigned ACC29              : 1;
    unsigned ACC30              : 1;
    unsigned ACC31              : 1;
    };
  } __PID1ACCHHbits_t;

extern __at(0x0612) volatile __PID1ACCHHbits_t PID1ACCHHbits;

#define _PID1ACC24              0x01
#define _ACC24                  0x01
#define _PID1ACC25              0x02
#define _ACC25                  0x02
#define _PID1ACC26              0x04
#define _ACC26                  0x04
#define _PID1ACC27              0x08
#define _ACC27                  0x08
#define _PID1ACC28              0x10
#define _ACC28                  0x10
#define _PID1ACC29              0x20
#define _ACC29                  0x20
#define _PID1ACC30              0x40
#define _ACC30                  0x40
#define _PID1ACC31              0x80
#define _ACC31                  0x80

//==============================================================================


//==============================================================================
//        PID1ACCU Bits

extern __at(0x0613) __sfr PID1ACCU;

typedef union
  {
  struct
    {
    unsigned PID1ACC32          : 1;
    unsigned PID1ACC33          : 1;
    unsigned PID1ACC34          : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned ACC32              : 1;
    unsigned ACC33              : 1;
    unsigned ACC34              : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __PID1ACCUbits_t;

