OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic14/pic16lf1619.h
#define VALID                   AT1CON1bits.VALID               // bit 0, shadows bit in AT1CON1bits
#define AT1VALID                AT1CON1bits.AT1VALID            // bit 0, shadows bit in AT1CON1bits
#define ACCS                    AT1CON1bits.ACCS                // bit 1, shadows bit in AT1CON1bits
#define AT1ACCS                 AT1CON1bits.AT1ACCS             // bit 1, shadows bit in AT1CON1bits
#define MPP                     AT1CON1bits.MPP                 // bit 2, shadows bit in AT1CON1bits
#define AT1MPP                  AT1CON1bits.AT1MPP              // bit 2, shadows bit in AT1CON1bits
#define PRP                     AT1CON1bits.PRP                 // bit 4, shadows bit in AT1CON1bits
#define AT1PRP                  AT1CON1bits.AT1PRP              // bit 4, shadows bit in AT1CON1bits
#define PHP                     AT1CON1bits.PHP                 // bit 6, shadows bit in AT1CON1bits
#define AT1PHP                  AT1CON1bits.AT1PHP              // bit 6, shadows bit in AT1CON1bits

#define AT1CP1S0                AT1CSEL1bits.AT1CP1S0           // bit 0, shadows bit in AT1CSEL1bits
#define CP1S0                   AT1CSEL1bits.CP1S0              // bit 0, shadows bit in AT1CSEL1bits
#define AT1CP1S1                AT1CSEL1bits.AT1CP1S1           // bit 1, shadows bit in AT1CSEL1bits
#define CP1S1                   AT1CSEL1bits.CP1S1              // bit 1, shadows bit in AT1CSEL1bits
#define AT1CP1S2                AT1CSEL1bits.AT1CP1S2           // bit 2, shadows bit in AT1CSEL1bits
#define CP1S2                   AT1CSEL1bits.CP1S2              // bit 2, shadows bit in AT1CSEL1bits

#define AT1CP2S0                AT1CSEL2bits.AT1CP2S0           // bit 0, shadows bit in AT1CSEL2bits
#define CP2S0                   AT1CSEL2bits.CP2S0              // bit 0, shadows bit in AT1CSEL2bits
#define AT1CP2S1                AT1CSEL2bits.AT1CP2S1           // bit 1, shadows bit in AT1CSEL2bits
#define CP2S1                   AT1CSEL2bits.CP2S1              // bit 1, shadows bit in AT1CSEL2bits
#define AT1CP2S2                AT1CSEL2bits.AT1CP2S2           // bit 2, shadows bit in AT1CSEL2bits
#define CP2S2                   AT1CSEL2bits.CP2S2              // bit 2, shadows bit in AT1CSEL2bits

#define AT1CP3S0                AT1CSEL3bits.AT1CP3S0           // bit 0, shadows bit in AT1CSEL3bits
#define CP3S0                   AT1CSEL3bits.CP3S0              // bit 0, shadows bit in AT1CSEL3bits
#define AT1CP3S1                AT1CSEL3bits.AT1CP3S1           // bit 1, shadows bit in AT1CSEL3bits
#define CP3S1                   AT1CSEL3bits.CP3S1              // bit 1, shadows bit in AT1CSEL3bits
#define AT1CP3S2                AT1CSEL3bits.AT1CP3S2           // bit 2, shadows bit in AT1CSEL3bits
#define CP3S2                   AT1CSEL3bits.CP3S2              // bit 2, shadows bit in AT1CSEL3bits

#define AT1ERR8                 AT1ERRHbits.AT1ERR8             // bit 0, shadows bit in AT1ERRHbits
#define ERR8                    AT1ERRHbits.ERR8                // bit 0, shadows bit in AT1ERRHbits
#define ERRH0                   AT1ERRHbits.ERRH0               // bit 0, shadows bit in AT1ERRHbits
#define AT1ERR9                 AT1ERRHbits.AT1ERR9             // bit 1, shadows bit in AT1ERRHbits
#define ERR9                    AT1ERRHbits.ERR9                // bit 1, shadows bit in AT1ERRHbits
#define ERRH1                   AT1ERRHbits.ERRH1               // bit 1, shadows bit in AT1ERRHbits
#define AT1ERR10                AT1ERRHbits.AT1ERR10            // bit 2, shadows bit in AT1ERRHbits
#define ERR10                   AT1ERRHbits.ERR10               // bit 2, shadows bit in AT1ERRHbits
#define ERRH2                   AT1ERRHbits.ERRH2               // bit 2, shadows bit in AT1ERRHbits
#define AT1ERR11                AT1ERRHbits.AT1ERR11            // bit 3, shadows bit in AT1ERRHbits
#define ERR11                   AT1ERRHbits.ERR11               // bit 3, shadows bit in AT1ERRHbits
#define ERRH3                   AT1ERRHbits.ERRH3               // bit 3, shadows bit in AT1ERRHbits
#define AT1ERR12                AT1ERRHbits.AT1ERR12            // bit 4, shadows bit in AT1ERRHbits
#define ERR12                   AT1ERRHbits.ERR12               // bit 4, shadows bit in AT1ERRHbits
#define ERRH4                   AT1ERRHbits.ERRH4               // bit 4, shadows bit in AT1ERRHbits
#define AT1ERR13                AT1ERRHbits.AT1ERR13            // bit 5, shadows bit in AT1ERRHbits
#define ERR13                   AT1ERRHbits.ERR13               // bit 5, shadows bit in AT1ERRHbits
#define ERRH5                   AT1ERRHbits.ERRH5               // bit 5, shadows bit in AT1ERRHbits
#define AT1ERR14                AT1ERRHbits.AT1ERR14            // bit 6, shadows bit in AT1ERRHbits
#define ERR14                   AT1ERRHbits.ERR14               // bit 6, shadows bit in AT1ERRHbits
#define ERRH6                   AT1ERRHbits.ERRH6               // bit 6, shadows bit in AT1ERRHbits
#define AT1ERR15                AT1ERRHbits.AT1ERR15            // bit 7, shadows bit in AT1ERRHbits
#define ERR15                   AT1ERRHbits.ERR15               // bit 7, shadows bit in AT1ERRHbits
#define ERRH7                   AT1ERRHbits.ERRH7               // bit 7, shadows bit in AT1ERRHbits

#define AT1ERR0                 AT1ERRLbits.AT1ERR0             // bit 0, shadows bit in AT1ERRLbits
#define ERR0                    AT1ERRLbits.ERR0                // bit 0, shadows bit in AT1ERRLbits
#define ERRL0                   AT1ERRLbits.ERRL0               // bit 0, shadows bit in AT1ERRLbits
#define AT1ERR1                 AT1ERRLbits.AT1ERR1             // bit 1, shadows bit in AT1ERRLbits
#define ERR1                    AT1ERRLbits.ERR1                // bit 1, shadows bit in AT1ERRLbits
#define ERRL1                   AT1ERRLbits.ERRL1               // bit 1, shadows bit in AT1ERRLbits
#define AT1ERR2                 AT1ERRLbits.AT1ERR2             // bit 2, shadows bit in AT1ERRLbits
#define ERR2                    AT1ERRLbits.ERR2                // bit 2, shadows bit in AT1ERRLbits
#define ERRL2                   AT1ERRLbits.ERRL2               // bit 2, shadows bit in AT1ERRLbits
#define AT1ERR3                 AT1ERRLbits.AT1ERR3             // bit 3, shadows bit in AT1ERRLbits
#define ERR3                    AT1ERRLbits.ERR3                // bit 3, shadows bit in AT1ERRLbits
#define ERRL3                   AT1ERRLbits.ERRL3               // bit 3, shadows bit in AT1ERRLbits
#define AT1ERR4                 AT1ERRLbits.AT1ERR4             // bit 4, shadows bit in AT1ERRLbits
#define ERR4                    AT1ERRLbits.ERR4                // bit 4, shadows bit in AT1ERRLbits
#define ERRL4                   AT1ERRLbits.ERRL4               // bit 4, shadows bit in AT1ERRLbits
#define AT1ERR5                 AT1ERRLbits.AT1ERR5             // bit 5, shadows bit in AT1ERRLbits
#define ERR5                    AT1ERRLbits.ERR5                // bit 5, shadows bit in AT1ERRLbits
#define ERRL5                   AT1ERRLbits.ERRL5               // bit 5, shadows bit in AT1ERRLbits
#define AT1ERR6                 AT1ERRLbits.AT1ERR6             // bit 6, shadows bit in AT1ERRLbits
#define ERR6                    AT1ERRLbits.ERR6                // bit 6, shadows bit in AT1ERRLbits
#define ERRL6                   AT1ERRLbits.ERRL6               // bit 6, shadows bit in AT1ERRLbits
#define AT1ERR7                 AT1ERRLbits.AT1ERR7             // bit 7, shadows bit in AT1ERRLbits
#define ERR7                    AT1ERRLbits.ERR7                // bit 7, shadows bit in AT1ERRLbits
#define ERRL7                   AT1ERRLbits.ERRL7               // bit 7, shadows bit in AT1ERRLbits

#define AT1PERIE                AT1IE0bits.AT1PERIE             // bit 0
#define AT1MISSIE               AT1IE0bits.AT1MISSIE            // bit 1
#define AT1PHSIE                AT1IE0bits.AT1PHSIE             // bit 2

#define AT1CC1IE                AT1IE1bits.AT1CC1IE             // bit 0
#define AT1CC2IE                AT1IE1bits.AT1CC2IE             // bit 1
#define AT1CC3IE                AT1IE1bits.AT1CC3IE             // bit 2

#define AT1PERIF                AT1IR0bits.AT1PERIF             // bit 0
#define AT1MISSIF               AT1IR0bits.AT1MISSIF            // bit 1
#define AT1PHSIF                AT1IR0bits.AT1PHSIF             // bit 2

#define AT1CC1IF                AT1IR1bits.AT1CC1IF             // bit 0
#define AT1CC2IF                AT1IR1bits.AT1CC2IF             // bit 1
#define AT1CC3IF                AT1IR1bits.AT1CC3IF             // bit 2

